# Projeto: Vendas de Clientes

- O objetivo desse projeto é realizar uma análise dos resultados de um evento com os clientes de uma empresa de vendas online. Foi coletado um conjunto de dados que contém os clientes que mais gastaram com produtos dentro de 5 dias de vendas, que é o período de duração do evento. 
- Essa análise vai identificar o cliente com a maior compra na semana, que irá receber um prêmio da loja, e posteriormente, ela pode ajudar a empresa a criar novas estratégias para atrair mais clientes.
- A base de dados utilizada nessa análise é a dados_vendas_clientes.json e contém informações importantes sobre os clientes como, o nome de cadastro do cliente, o valor total pago na compra e o dia da compra.



--------------------------------------------
O objetivo desse projeto é realizar uma análise dos resultados de um evento com os clientes de uma empresa de vendas online. Foi coletado um conjunto de dados que contém os clientes que mais gastaram com produtos dentro de 5 dias de vendas, que é o período de duração do evento. Essa análise vai identificar o cliente com a maior compra na semana, que irá receber um prêmio da loja, e posteriormente, ela pode ajudar a empresa a criar novas estratégias para atrair mais clientes.

In [6]:
import pandas as pd
import numpy as np

In [3]:
dados = pd.read_json('../Dados/dados_vendas_clientes.json')

dados = pd.json_normalize(dados['dados_vendas'])
dados

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","[R$ 836,5, R$ 573,33, R$ 392,8, R$ 512,34]"
1,07/06/2022,"[Isabely JOanes 738, Isabely JOanes 738, Isabe...","[R$ 825,31, R$ 168,07, R$ 339,18, R$ 314,69]"
2,08/06/2022,"[Isabely JOanes 738, JOãO Gabriel 671, Julya m...","[R$ 682,05, R$ 386,34, R$ 622,65, R$ 630,79]"
3,09/06/2022,"[Julya meireles 914, MaRIA Julia 444, MaRIA Ju...","[R$ 390,3, R$ 759,16, R$ 334,47, R$ 678,78]"
4,10/06/2022,"[MaRIA Julia 444, PEDRO PASCO 812, Paulo castr...","[R$ 314,24, R$ 311,15, R$ 899,16, R$ 885,24]"

In [4]:
dados = dados.explode(column=['Cliente', 'Valor da compra'])
dados

  Data de venda             Cliente Valor da compra
0    06/06/2022     @ANA _LUCIA 321        R$ 836,5
0    06/06/2022  DieGO ARMANDIU 210       R$ 573,33
0    06/06/2022  DieGO ARMANDIU 210        R$ 392,8
0    06/06/2022  DieGO ARMANDIU 210       R$ 512,34
1    07/06/2022  Isabely JOanes 738       R$ 825,31
1    07/06/2022  Isabely JOanes 738       R$ 168,07
1    07/06/2022  Isabely JOanes 738       R$ 339,18
1    07/06/2022  Isabely JOanes 738       R$ 314,69
2    08/06/2022  Isabely JOanes 738       R$ 682,05
2    08/06/2022    JOãO Gabriel 671       R$ 386,34
2    08/06/2022  Julya meireles 914       R$ 622,65
2    08/06/2022  Julya meireles 914       R$ 630,79
3    09/06/2022  Julya meireles 914        R$ 390,3
3    09/06/2022     MaRIA Julia 444       R$ 759,16
3    09/06/2022     MaRIA Julia 444       R$ 334,47
3    09/06/2022     MaRIA Julia 444       R$ 678,78
4    10/06/2022     MaRIA Julia 444       R$ 314,24
4    10/06/2022     PEDRO PASCO 812       R$ 311,15
4    10/06/2022    Paulo castro 481       R$ 899,16
4    10/06/2022   Thiago fritzz 883       R$ 885,24

## Desafio:
- Remover os dados em listas dentro do DataFrame;
- Verificar os tipos de dados;
- Identificar colunas numéricas;
- Transformar a coluna numérica para o tipo numérico.

In [8]:
dados['Valor da compra'] = dados['Valor da compra'].apply(lambda x: x.replace('R$', '').replace(',', '.').strip())
dados['Valor da compra'] = dados['Valor da compra'].astype(np.float64)

In [10]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, 0 to 4
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     object
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     float64
dtypes: float64(1), object(2)
memory usage: 640.0+ bytes

Devido a uma instabilidade no site da empresa, tivemos problemas com os nomes dos clientes durante o salvamento. Isso resultou em uma coluna de nomes de clientes com uma mistura de letras, maiúsculas e minúsculas, números e outros caracteres.

Sabendo disso, manipule os textos presentes na coluna Cliente para que seja obtido como resultado os nomes dos clientes em letras minúsculas, com a ausência de caracteres especiais ou números.

In [ ]:
dados['Cliente'] = dados['Cliente'].str.replace('[^a-zA-Z]', ' ', regex=True).str.lower()

In [21]:
dados

  Data de venda             Cliente  Valor da compra
0    06/06/2022      ana  lucia               836.50
0    06/06/2022  diego armandiu               573.33
0    06/06/2022  diego armandiu               392.80
0    06/06/2022  diego armandiu               512.34
1    07/06/2022  isabely joanes               825.31
1    07/06/2022  isabely joanes               168.07
1    07/06/2022  isabely joanes               339.18
1    07/06/2022  isabely joanes               314.69
2    08/06/2022  isabely joanes               682.05
2    08/06/2022    jo o gabriel               386.34
2    08/06/2022  julya meireles               622.65
2    08/06/2022  julya meireles               630.79
3    09/06/2022  julya meireles               390.30
3    09/06/2022     maria julia               759.16
3    09/06/2022     maria julia               334.47
3    09/06/2022     maria julia               678.78
4    10/06/2022     maria julia               314.24
4    10/06/2022     pedro pasco               311.15
4    10/06/2022    paulo castro               899.16
4    10/06/2022   thiago fritzz               885.24

Na coluna Data de venda, temos datas em formato 'dia/mês/ano' (dd/mm/AAAA). Transforme esses dados para o tipo datetime e busque uma forma de visualização de subconjunto que possa contribuir no objetivo do contexto que os dados estão inseridos.

In [26]:
dados['Data de venda'] = pd.to_datetime(dados['Data de venda'], format='%d/%m/%Y')

In [47]:
total_compra_cliente = dados.groupby('Cliente')[['Valor da compra']].sum().reset_index()

display(total_compra_cliente)


maior_compra = total_compra_cliente.max()
print(f"A maior compra foi do(a) {maior_compra.Cliente.strip()} no valor de R$ {maior_compra['Valor da compra']}")

              Cliente  Valor da compra
0      ana  lucia               836.50
1  diego armandiu              1478.47
2  isabely joanes              2329.30
3    jo o gabriel               386.34
4  julya meireles              1643.74
5     maria julia              2086.65
6    paulo castro               899.16
7     pedro pasco               311.15
8   thiago fritzz               885.24

A maior compra foi do(a) thiago fritzz no valor de R$ 2329.3